---
kind: property
id: P:Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs.NewFamilyId
source: html/98344b60-1514-1cc0-dbd2-0a8032d902d3.htm
---
# Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs.NewFamilyId Property

The newly loaded family id.

## Syntax (C#)
```csharp
public ElementId NewFamilyId { get; }
```